[info]
drivername=.NET CLR Data
symbolfile=_DataPerfCounters.h

[languages]
009=language009
011=language011

[objects]
OBJECT_1_009_NAME=.NET CLR Data
OBJECT_1_011_NAME=.NET CLR Data

[text]
OBJECT_1_009_NAME=.NET CLR Data
OBJECT_1_009_HELP=.Net CLR Data

DEVICE_COUNTER_1_009_NAME=SqlClient: Current # pooled and nonpooled connections
DEVICE_COUNTER_1_009_HELP=Current number of connections, pooled or not.

DEVICE_COUNTER_2_009_NAME=SqlClient: Current # pooled connections
DEVICE_COUNTER_2_009_HELP=Current number of connections in all pools associated with the process.

DEVICE_COUNTER_3_009_NAME=SqlClient: Current # connection pools
DEVICE_COUNTER_3_009_HELP=Current number of pools associated with the process.

DEVICE_COUNTER_4_009_NAME=SqlClient: Peak # pooled connections
DEVICE_COUNTER_4_009_HELP=The highest number of connections in all pools since the process started.

DEVICE_COUNTER_5_009_NAME=SqlClient: Total # failed connects
DEVICE_COUNTER_5_009_HELP=The total number of connection open attempts that have failed for any reason.

DEVICE_COUNTER_6_009_NAME=SqlClient: Total # failed commands
DEVICE_COUNTER_6_009_HELP=The total number of command executes that have failed for any reason.

OBJECT_1_011_NAME=.NET CLR Data
OBJECT_1_011_HELP=.Net CLR Data

DEVICE_COUNTER_1_011_NAME=SqlClient: Current # pooled and nonpooled connections
DEVICE_COUNTER_1_011_HELP=ƒv[ƒ‹‚Ì¥”ñ‚É‚©‚©‚í‚ç‚¸Œ»Ý‚ÌÚ‘±”‚Å‚·B

DEVICE_COUNTER_2_011_NAME=SqlClient: Current # pooled connections
DEVICE_COUNTER_2_011_HELP=ƒvƒƒZƒX‚ÉŠÖ˜A‚·‚é‘Sƒv[ƒ‹“à‚ÌŒ»Ý‚ÌÚ‘±”‚Å‚·B

DEVICE_COUNTER_3_011_NAME=SqlClient: Current # connection pools
DEVICE_COUNTER_3_011_HELP=ƒvƒƒZƒX‚ÉŠÖ˜A‚·‚éŒ»Ý‚Ìƒv[ƒ‹”‚Å‚·B

DEVICE_COUNTER_4_011_NAME=SqlClient: Peak # pooled connections
DEVICE_COUNTER_4_011_HELP=ƒvƒƒZƒX‚ªŠJŽn‚µ‚ÄˆÈ—ˆ‚Ì‘Sƒv[ƒ‹“à‚ÌÅ‘åÚ‘±”‚Å‚·B

DEVICE_COUNTER_5_011_NAME=SqlClient: Total # failed connects
DEVICE_COUNTER_5_011_HELP=Ž¸”s——R‚É‚©‚©‚í‚ç‚¸Ú‘±‚µ‚æ‚¤‚Æ‚µ‚ÄŽ¸”s‚µ‚½‡Œv”‚Å‚·B

DEVICE_COUNTER_6_011_NAME=SqlClient: Total # failed commands
DEVICE_COUNTER_6_011_HELP=Ž¸”s——R‚É‚©‚©‚í‚ç‚¸ŽÀs‚Å‚«‚È‚©‚Á‚½ƒRƒ}ƒ“ƒh‚Ì‡Œv”‚Å‚·B
